tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/0/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    downLeft
    {
        type zeroGradient;
    }
    downRight
    {
        type zeroGradient;
    }
    upLeft
    {
        type zeroGradient;
    }
    upRight
    {
        type zeroGradient;
    }
    bottomWall
    {
        type greyDiffusiveRadiation;
        T T;
        emissivity 0.5;
        value uniform 0;
    }
    bottomCHT
    {
        type greyDiffusiveRadiation;
        T T;
        emissivity 0.5;
        value uniform 0;
    }
    topWall
    {
        type greyDiffusiveRadiation;
        T T;
        emissivity 0.5;
        value uniform 0;
    }
    topCHT
    {
        type greyDiffusiveRadiation;
        T T;
        emissivity 0.5;
        value uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
