tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/0/kappaEff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      kappaEff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 0;

boundaryField
{
    downLeft
    {
        type            zeroGradient;
    }
    downRight
    {
        type            zeroGradient;
    }
    upLeft
    {
        type            zeroGradient;
    }
    upRight
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    bottomCHT
    {
        type            chtRcThermalDiffusivity;
        remoteField     k;
        value           uniform 0;
    }
    topCHT
    {
        type            chtRcThermalDiffusivity;
        remoteField     k;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
