tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 800;

boundaryField
{
    leftSolid
    {
        type            zeroGradient;
    }
    rightSolid
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            chtRcTemperature;
        radiation       off;
        remoteField     T;
        K               k;

        value           uniform 800;
    }
    topWall
    {
        type            chtRcTemperature;
        radiation       off;
        remoteField     T;
        K               k;

        value           uniform 800;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
