tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    // Back plane
    (   0    0    0 )
    ( 200    0    0 )
    (   0    2    0 )
    ( 200    2    0 )
    (   0    3    0 )
    ( 200    3    0 )
    (   0    5    0 )
    ( 200    5    0 )

    // Front plane
    (   0    0    2 )
    ( 200    0    2 )
    (   0    2    2 )
    ( 200    2    2 )
    (   0    3    2 )
    ( 200    3    2 )
    (   0    5    2 )
    ( 200    5    2 )
);

blocks
(
    hex (0 1 3 2 8 9 11 10) bottomChannel (200 20  1) simpleGrading (1 1 1)
    hex (4 5 7 6 12 13 15 14) topChannel (200 20  1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    downLeft
    {
        type    patch;
        faces
        (
            (0 8 10 2)
        );
    }
    downRight
    {
        type    patch;
        faces
        (
            (1 3 11 9)
        );
    }
    upLeft
    {
        type    patch;
        faces
        (
            (4 12 14 6)
        );
    }
    upRight
    {
        type    patch;
        faces
        (
            (5 7 15 13)
        );
    }
    bottomWall
    {
        type    wall;
        faces
        (
            (0 1 9 8)
        );
    }
    topWall
    {
        type    wall;
        faces
        (
            (6 14 15 7)
        );
    }
    bottomCHT
    {
        type    regionCouple;
        faces
        (
            (2 10 11 3)
        );

        shadowRegion    solid;
        shadowPatch     bottomWall;
        zone            bottomCHTZone;
        attached        off;
        isWall          on;
        master          on;
        bridgeOverlap   off;
    }
    topCHT
    {
        type    regionCouple;
        faces
        (
            (4 5 13 12)
        );

        shadowRegion    solid;
        shadowPatch     topWall;
        zone            topCHTZone;
        attached        off;
        isWall          on;
        master          on;
        bridgeOverlap   off;
    }
    frontAndBack
    {
        type   empty;
        faces
        (
            (0 2 3 1)
            (4 6 7 5)
            (8 9 11 10)
            (12 13 15 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
