tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p_rgh|p"
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.0;
    }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.0;
    }
    T_T
    {
        solver           BiCGStab;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.0;
    }
    Ii
    {
        solver          BiCGStab;
        preconditioner  ILU0;

        minIter         1;
        tolerance       1e-07;
        relTol          0.01;
    }
    G
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          1000;
        tolerance        1e-7;
        relTol           0.0;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.0;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          100;
        tolerance        1e-7;
        relTol           0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    p_rghRefCell        0;
    p_rghRefValue       0;
}

relaxationFactors
{
    equations
    {
        U               0.8;
        T               0.8;
        G               0.8;
    }
    fields
    {
        p_rgh           0.3;
    }
}

// ************************************************************************* //
