tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/system/solid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    // Back plane
    (   0    2    0 )
    ( 200    2    0 )
    (   0    3    0 )
    ( 200    3    0 )

    // Front plane
    (   0    2    2 )
    ( 200    2    2 )
    (   0    3    2 )
    ( 200    3    2 )
);

blocks
(
    hex (0 1 3 2 4 5 7 6) solidBlock (200 10  1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftSolid
    {
        type    patch;
        faces
        (
            (0 4 6 2)
        );
    }
    rightSolid
    {
        type    patch;
        faces
        (
            (1 3 7 5)
        );
    }
    bottomWall
    {
        type regionCouple;
        faces
        (
            (0 1 5 4)
        );

        shadowRegion    region0;
        shadowPatch     bottomCHT;
        attached        off;
        isWall          off;
        zone            bottomWallZone;
        master          off;
        bridgeOverlap   off;
    }
    topWall
    {
        type regionCouple;
        faces
        (
            (6 7 3 2)
        );

        shadowRegion    region0;
        shadowPatch     topCHT;
        attached        off;
        isWall          off;
        zone            topWallZone;
        master          off;
        bridgeOverlap   off;
    }
    frontAndBack
    {
        type   empty;
        faces
        (
            (0 1 3 2)
            (4 5 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
