tutorials/coupled/conjugateHeatSimpleFoam/twoChannels-noRadiation/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    limitTSolid (299 1600);
}

relaxationFactors
{
    T 0.99999;
}

// ************************************************************************* //
